# TableMergedCell Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableMergedCell Properties
TableMergedCell Class See Also
---
The TableMergedCell type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Bottom | Specifies the row index of the bottom-right corner of a table grid. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Left | Specifies the column index of the top-left corner of a table grid. |
| Right | Specifies the column index of the bottom-right corner of a table grid. |
| Top | Specifies the row index of the top-left corner of a table grid. |

# See Also
TableMergedCell Class
Autodesk.Revit.DB Namespace